stm32duino/Arduino_Core_STM32/cores/arduino/stm32/analog.c
/**
  ******************************************************************************
  * @file    analog.c
  * @author  WI6LABS
  * @version V1.0.0
  * @date    01-August-2016
  * @brief   provide analog services (ADC + PWM)
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f4xx_system
  * @{
  */

/** @addtogroup STM32F4xx_System_Private_Includes
  * @{
  */
#include "stm32_def.h"
#include "analog.h"
#include "timer.h"
#include "PinAF_STM32F1.h"
#include "dma.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_TypesDefinitions
  * @{
  */
/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Defines
  * @{
  */

// Use smalled sample time decreases ADC conversion time
#if defined(ADC_SAMPLETIME_1CYCLE_5)
#define SAMPLINGTIME        ADC_SAMPLETIME_1CYCLE_5;
#elif defined(ADC_SAMPLETIME_2CYCLES_5)
#define SAMPLINGTIME        ADC_SAMPLETIME_2CYCLES_5;
#elif defined(ADC_SAMPLETIME_3CYCLES)
#define SAMPLINGTIME        ADC_SAMPLETIME_3CYCLES;
#elif defined(ADC_SAMPLETIME_4CYCLES)
#define SAMPLINGTIME        ADC_SAMPLETIME_4CYCLES;
#else
#error "ADC SAMPLINGTIME could not be defined"
#endif

// Use smaller clock prescaler to keep ADC conversion time as short as possible
#ifndef STM32F1xx
#ifdef ADC_CLOCK_SYNC_PCLK_DIV1
#define ADC_CLOCK_DIV       ADC_CLOCK_SYNC_PCLK_DIV1
#elif defined(ADC_CLOCK_ASYNC_DIV1)
#define ADC_CLOCK_DIV       ADC_CLOCK_ASYNC_DIV1
#elif defined(ADC_CLOCK_SYNC_PCLK_DIV2)
#define ADC_CLOCK_DIV       ADC_CLOCK_SYNC_PCLK_DIV2
#else
#error "ADC_CLOCK_DIV could not be defined"
#endif
#endif /* STM32F1xx */

#ifndef ADC_REGULAR_RANK_1
#define ADC_REGULAR_RANK_1  1
#endif
/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Macros
  * @{
  */

/**
  * @}
  */
const DMAMap_t DMAMap_ADC[] = {
#if defined(STM32F0xx) || defined(STM32F1xx) || defined(STM32F3xx) || \
    defined(STM32L0xx) || defined(STM32L1xx) || defined(STM32L4xx)
  {ADC1, 1, 1, 0, DMA1_Channel1_IRQn},
#if defined(STM32F0xx)
  {ADC1, 1, 2, NC, DMA1_Ch2_3_DMA2_Ch1_2_IRQn},
#if defined(STM32F091xC) || defined(STM32F098xx)
  {ADC1, 2, 5, NC, DMA1_Ch4_7_DMA2_Ch3_5_IRQn},
#endif //defined(STM32F091xC) || defined(STM32F098xx)
#endif //defined(STM32F0xx)
#if defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || \
    defined(STM32F398xx)
  {ADC2, 2, 1, NC, DMA2_Channel1_IRQn},
  {ADC2, 2, 3, NC, DMA2_Channel3_IRQn},
  {ADC3, 2, 5, NC, DMA2_Channel5_IRQn},
  {ADC4, 2, 2, NC, DMA2_Channel2_IRQn},
  {ADC4, 2, 4, NC, DMA2_Channel4_IRQn},
#endif //defined(STM32F303xC) || defined(STM32F303xE) || defined(STM32F358xx) || defined(STM32F398xx)
#if defined(STM32F328xx) || defined(STM32F303x8) || defined(STM32F334x8)
  {ADC2, 1, 2, NC, DMA1_Channel2_IRQn},
  {ADC2, 1, 4, NC, DMA1_Channel4_IRQn},
#endif //defined(STM32F328xx) || defined(STM32F303x8) || defined(STM32F334x8)
#if defined(STM32L0xx)
  {ADC1, 1, 2, 0, DMA1_Channel2_3_IRQn},
#endif //defined(STM32L0xx)
#if defined(STM32L4xx)
  {ADC1, 2, 3, 0, DMA2_Channel3_IRQn},
#if defined(STM32L476xx) || defined(STM32L476xx)
  {ADC2, 1, 2, 0, DMA1_Channel2_IRQn},
  {ADC2, 2, 4, 0, DMA2_Channel4_IRQn},
  {ADC3, 1, 3, 0, DMA1_Channel3_IRQn},
  {ADC3, 2, 5, 0, DMA2_Channel5_IRQn},
#endif //defined(STM32L476xx) || defined(STM32L476xx)
#endif //defined(STM32L4xx)
#endif //defined(STM32F0xx) || defined(STM32F1xx) || defined(STM32F3xx) || defined(STM32L0xx) || defined(STM32L1xx) || defined(STM32L4xx)
#if defined(STM32F2xx) || defined(STM32F4xx)
  {ADC1, 2, 0, 0, DMA2_Stream0_IRQn},
  {ADC1, 2, 4, 0, DMA2_Stream4_IRQn},
#if defined(STM32F2xx) || defined(STM32F429xx) || defined(STM32F407xx)
  {ADC2, 2, 2, 1, DMA2_Stream2_IRQn},
  {ADC2, 2, 3, 1, DMA2_Stream3_IRQn},
  {ADC3, 2, 0, 2, DMA2_Stream0_IRQn},
  {ADC3, 2, 1, 2, DMA2_Stream1_IRQn},
#endif //defined(STM32F2xx) || defined(STM32F429xx) || defined(STM32F407xx)
#endif //defined(STM32F2xx) || defined(STM32F4xx)
  {NP, NC, NC, NC, NP}
};

/* ADC context                                                                */
ADCContext_t ADCContextMap[ADC_NUM] = {0};

/* GPIO pin use for DAC or PWM                                                */
static PinName g_current_pin = NC;


/**
  * @brief get ADC context structure
  * @param instance : pointer to the instance
  * @retval         : pointer to the ADCx context structure
  */
ADCContext_t *get_adc_context(void *instance)
{
  ADCContext_t *ADCxContext = NULL;

  #ifdef ADC1_BASE
  if (instance == ADC1)
  {
    ADCxContext = &ADCContextMap[0];
  }
  #endif
  #ifdef ADC2_BASE
  if (instance == ADC2)
  {
     ADCxContext = &ADCContextMap[1];
  }
  #endif
  #ifdef ADC3_BASE
  if (instance == ADC3)
  {
    ADCxContext = &ADCContextMap[2];
  }
  #endif
  #ifdef ADC4_BASE
  if (instance == ADC4)
  {
    ADCxContext = &ADCContextMap[3];
  }
  #endif
  return ADCxContext;
}

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_FunctionPrototypes
  * @{
  */
static uint32_t get_adc_channel(PinName pin)
{
  uint32_t function = pinmap_function(pin, PinMap_ADC);
  uint32_t channel = 0;
  switch(STM_PIN_CHANNEL(function)) {
#ifdef ADC_CHANNEL_0
    case 0:
      channel = ADC_CHANNEL_0;
      break;
#endif
    case 1:
      channel = ADC_CHANNEL_1;
    break;
    case 2:
      channel = ADC_CHANNEL_2;
    break;
    case 3:
      channel = ADC_CHANNEL_3;
    break;
    case 4:
      channel = ADC_CHANNEL_4;
    break;
    case 5:
      channel = ADC_CHANNEL_5;
    break;
    case 6:
      channel = ADC_CHANNEL_6;
    break;
    case 7:
      channel = ADC_CHANNEL_7;
    break;
    case 8:
      channel = ADC_CHANNEL_8;
    break;
    case 9:
      channel = ADC_CHANNEL_9;
    break;
    case 10:
      channel = ADC_CHANNEL_10;
    break;
    case 11:
      channel = ADC_CHANNEL_11;
    break;
    case 12:
      channel = ADC_CHANNEL_12;
    break;
    case 13:
      channel = ADC_CHANNEL_13;
    break;
    case 14:
      channel = ADC_CHANNEL_14;
    break;
    case 15:
      channel = ADC_CHANNEL_15;
    break;
    case 16:
      channel = ADC_CHANNEL_TEMPSENSOR;
    break;
    case 17:
      channel = ADC_CHANNEL_VREFINT;
    break;
#ifdef ADC_CHANNEL_VBAT
	case 18:
      channel = ADC_CHANNEL_VBAT;
    break;
#endif
    default:
      channel = 0;
    break;
   }
  return channel;
}

