stm32duino/Arduino_Core_STM32/cores/arduino/stm32/analog.c
  if(HAL_ADC_DeInit(AdcHandle) != HAL_OK) {
    return 0;
  }

  return uhADCxConvertedValue;
}

/**
  * @brief  This function will use DMA for ADC conversion
  * @param  pin               : the pin to use
  * @param  pData             : pointer to buffer where write data
  * @param  lData             : Number of sample
  * @param  callback          : Callback function to execute when conversion is done
  * @param  functionParameter : Callback function parameter
  * @retval 1 is success, 0 if fail.
  */
bool adc_read_value_dma(PinName pin, uint32_t *pData, uint32_t lData,
                            void (*callback)(void *user_data), void *functionParameter)
{
  void *peripheral;
  ADC_ChannelConfTypeDef sConfig;
  ADCContext_t *ADCxContext = NULL;
  ADC_HandleTypeDef *AdcHandle = NULL;

  /* ### - 1 - Initialize ADC peripheral #################################### */
  peripheral  = pinmap_peripheral(pin, PinMap_ADC);
  ADCxContext = get_adc_context(peripheral);

  if((peripheral == NP) || (ADCxContext == NULL)) {
    return 0;
  }

  ADCxContext->current_pin  = pin;                                             /* Needed for HAL_ADC_MspInit     */
  ADCxContext->cb           = callback;                                        /* Register the callback function */
  ADCxContext->user_data    = functionParameter;
  AdcHandle                 = &(ADCxContext->ADCHandle);
  AdcHandle->Instance       = peripheral;

  if (HAL_ADC_DeInit(AdcHandle) != HAL_OK)
  {
    return 0;
  }

#ifndef STM32F1xx
  AdcHandle->Init.ClockPrescaler        = ADC_CLOCK_DIV;                 /* Synchronous clock mode, input ADC clock divided by 1*/
  AdcHandle->Init.Resolution            = ADC_RESOLUTION_12B;            /* 12-bit resolution for converted data */
  AdcHandle->Init.EOCSelection          = ADC_EOC_SINGLE_CONV;           /* EOC flag picked-up to indicate conversion end */
  AdcHandle->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE; /* Parameter discarded because software trigger chosen */
  AdcHandle->Init.DMAContinuousRequests = DISABLE;                        /* ADC DMA to match with DMA normal mode */
#endif
  AdcHandle->Init.DataAlign             = ADC_DATAALIGN_RIGHT;           /* Right-alignment for converted data */
  AdcHandle->Init.ScanConvMode          = DISABLE;                       /* Sequencer disabled (ADC conversion on only 1 channel: channel set on rank 1) */
  AdcHandle->Init.ContinuousConvMode    = ENABLE;                        /* Continuous mode enabled (automatic conversion restart after each conversion) */
  AdcHandle->Init.DiscontinuousConvMode = DISABLE;                       /* Parameter discarded because sequencer is disabled */
  AdcHandle->Init.ExternalTrigConv      = ADC_SOFTWARE_START;            /* Software start to trig the 1st conversion manually, without external event */
  AdcHandle->State = HAL_ADC_STATE_RESET;
#if defined (STM32F0xx) ||defined (STM32L0xx)
  AdcHandle->Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
  AdcHandle->Init.LowPowerAutoPowerOff  = DISABLE;
  AdcHandle->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */
#ifdef STM32F0xx
  AdcHandle->Init.SamplingTimeCommon    = SAMPLINGTIME;
#else // STM32L0
  //LowPowerFrequencyMode to enable if clk freq < 2.8Mhz
  AdcHandle->Init.SamplingTime          = SAMPLINGTIME;
#endif
#else
#ifdef STM32F3xx
  AdcHandle->Init.LowPowerAutoWait      = DISABLE;                       /* Auto-delayed conversion feature disabled */
  AdcHandle->Init.Overrun               = ADC_OVR_DATA_OVERWRITTEN;      /* DR register is overwritten with the last conversion result in case of overrun */
#endif
  AdcHandle->Init.NbrOfConversion       = 1;                             /* Parameter discarded because sequencer is disabled */
  AdcHandle->Init.NbrOfDiscConversion   = 1;                             /* Parameter discarded because sequencer is disabled */
#endif

  ADCxContext->use_dma = true;

  /* Initialize ADC peripheral according to the passed parameters */
  if (HAL_ADC_Init(AdcHandle) != HAL_OK)
  {
    return 0;
  }

#if defined (STM32F0xx) || defined (STM32F1xx) || defined (STM32F3xx) || defined (STM32L0xx) || defined (STM32L4xx)
  /* ### - 2 - Start calibration ############################################ */
#if defined (STM32F0xx) || defined (STM32F1xx)
  if (HAL_ADCEx_Calibration_Start(AdcHandle) !=  HAL_OK)
#else //defined (STM32F0xx) || defined (STM32F1xx)
  if (HAL_ADCEx_Calibration_Start(AdcHandle, ADC_SINGLE_ENDED) !=  HAL_OK)
#endif
  {
    return 0;
  }
#endif //defined (STM32F0xx) || defined (STM32F1xx) || defined (STM32F3xx) || defined (STM32L0xx) || defined (STM32L4xx)

  /* ### - 3 - Channel configuration ######################################## */
  sConfig.Channel      = get_adc_channel(pin);        /* Sampled channel number */
#ifdef STM32L4xx
  if (!IS_ADC_CHANNEL(AdcHandle, sConfig.Channel)) return 0;
#else //STM32L4xx
  if (!IS_ADC_CHANNEL(sConfig.Channel)) return 0;
#endif
  sConfig.Rank         = ADC_REGULAR_RANK_1;          /* Rank of sampled channel number ADCx_CHANNEL */
#ifndef STM32L0xx
  sConfig.SamplingTime = SAMPLINGTIME;                /* Sampling time (number of clock cycles unit) */
#endif //STM32L0xx

  if (HAL_ADC_ConfigChannel(AdcHandle, &sConfig) != HAL_OK)
  {
    return 0;
  }

  /* ### - 4 - Start conversion in DMA mode ################################# */
  if (HAL_ADC_Start_DMA(AdcHandle, (uint32_t*)pData, lData) != HAL_OK)
  {
    return 0;
  }
  return 1;
}

/**
  * @brief  Conversion DMA transfer callback in non blocking mode
  * @param  hadc: ADC handle
  * @retval None
  */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *AdcHandle)
{
  /* Report to main program that ADC sequencer has reached its end */
  ADCContext_t *contextls = (ADCContext_t*) AdcHandle;
  if (contextls->cb != NULL)
  {
    contextls->cb(contextls->user_data);
  }
}


////////////////////////// PWM INTERFACE FUNCTIONS /////////////////////////////


/**
  * @brief TIM MSP Initialization
  *        This function configures the hardware resources used in this example:
  *           - Peripheral's clock enable
  *           - Peripheral's GPIO Configuration
  * @param htim: TIM handle pointer
  * @retval None
  */
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim)
{
  GPIO_InitTypeDef   GPIO_InitStruct;
  GPIO_TypeDef *port;
  uint32_t function = pinmap_function(g_current_pin, PinMap_PWM);
  /*##-1- Enable peripherals and GPIO Clocks #################################*/
  /* TIMx Peripheral clock enable */
  timer_enable_clock(htim);

  /* Enable GPIO Channels Clock */
  /* Enable GPIO clock ****************************************/
  port = set_GPIO_Port_Clock(STM_PORT(g_current_pin));

  /* Common configuration for all channels */
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
#ifdef STM32F1xx
  pin_SetF1AFPin(STM_PIN_AFNUM(function));
#else
  GPIO_InitStruct.Alternate = STM_PIN_AFNUM(function);
#endif /* STM32F1xx */
  GPIO_InitStruct.Pin = STM_GPIO_PIN(g_current_pin);

